In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'name': ['Jeff', 'Esha', 'Jia'], 
                   'age': [30, 56, 8]})
df

   name  age
0  Jeff   30
1  Esha   56
2   Jia    8

In [3]:
df['can_drive'] = np.where (df['age']>16, 1, 0)

In [4]:
df

   name  age  can_drive
0  Jeff   30          1
1  Esha   56          1
2   Jia    8          0

In [7]:
df

   name  age  can_drive
0  Jeff   30          1
1  Esha   56          1
2   Jia    8          0

In [9]:
df2 = df[df.name.str.startswith('J')]
df2

   name  age  can_drive
0  Jeff   30          1
2   Jia    8          0

In [10]:
df[df.age >= 16]

   name  age  can_drive
0  Jeff   30          1
1  Esha   56          1

In [11]:
df3 = pd.DataFrame({'name': ['Jeff', 'Esha', 'Jia'], 
                   'age': [30, 56, 8],
                   'city': ['New York', 'Atlanta', 'Shanghai']})

In [12]:
df3

   name  age      city
0  Jeff   30  New York
1  Esha   56   Atlanta
2   Jia    8  Shanghai

In [22]:
df3[df3['age'].between(21, 40)]

   name  age      city
0  Jeff   30  New York

In [26]:
 df3[df3['city'].isin(['New York','Tokyo'])]

   name  age      city
0  Jeff   30  New York

In [31]:
df = pd.DataFrame({'name': ['Jeff', 'Esha', 'Jia'], 
                   'age': [30, 56, 8],
                   'city': ['New York', 'Atlanta', 'Shanghai']})

In [37]:
df

   name  age      city
0  Jeff   32  New York
1  Esha   57   Atlanta
2   Jia    8  Shanghai

In [38]:
df.loc[df.city.isin(['New York', 'Atlanta']), 'age']+=1

In [39]:
df

   name  age      city
0  Jeff   33  New York
1  Esha   58   Atlanta
2   Jia    8  Shanghai

In [42]:
df4 = pd.DataFrame({'name': ['Jeff', 'Esha', 'Jia'], 
                   'age': [30, 56, 8]})
df4

   name  age
0  Jeff   30
1  Esha   56
2   Jia    8

In [43]:
df4['age_bracket'] = pd.cut(x=df4['age'], bins=[0,10,19,30,50,65])

In [44]:
df4

   name  age age_bracket
0  Jeff   30    (19, 30]
1  Esha   56    (50, 65]
2   Jia    8     (0, 10]

In [45]:
#define first DataFrame
dfA = pd.DataFrame({'player': ['A', 'B', 'C', 'D', 'E', 'F'],
                    'team': ['Mavs', 'Mavs', 'Mavs', 'Mavs', 'Nets', 'Nets']})

#define second DataFrame
dfB = pd.DataFrame({'player': ['A', 'B', 'C', 'D', 'E', 'F'],
                    'points': [22, 29, 34, 20, 15, 19]})

In [46]:
joined_df = pd.merge(dfA,
                     dfB,
                     on ='player',
                     how ='left')

In [47]:
joined_df

  player  team  points
0      A  Mavs      22
1      B  Mavs      29
2      C  Mavs      34
3      D  Mavs      20
4      E  Nets      15
5      F  Nets      19